Revit 2024 API
ViewShapeBuilder Constructor
 Default constructor for an ViewShapeBuilder object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public ViewShapeBuilder()
Visual Basic
Public Sub New
Visual C++
public:
ViewShapeBuilder()
See Also
ViewShapeBuilder Class
ViewShapeBuilder Overload
Autodesk.Revit.DB Namespace